[
  {
    "slug": "2025-08-18-1957582030767837330",
    "path": "threads/2025-08-18-1957582030767837330.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-18-1957582030767837330.md",
    "title": "Reading Sean Goedecke on system design is such a great experience. It is all about owning state. Fan...",
    "date": "2025-08-18T23:15:06.927036Z",
    "excerpt": "Reading Sean Goedecke on system design is such a great experience. It is all about owning state. Fancy setups often hide unclear write ownership. The boring win.",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1957582030767837330"
    }
  },
  {
    "slug": "2025-08-18-1957551831393136778",
    "path": "threads/2025-08-18-1957551831393136778.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-18-1957551831393136778.md",
    "title": "Been tinkering with avatar agents lately, and this project is pretty neat. StableAvatar is an end to...",
    "date": "2025-08-18T21:15:01.110485Z",
    "excerpt": "Been tinkering with avatar agents lately, and this project is pretty neat. StableAvatar is an end to end video diffusion transformer that makes infinite length audio driven avatar videos from a single reference image and audio - no post processing. The identity stays intact.\n\nThe clever bit is a time step-aware audio adapter. It modulates the denoiser at every diffusion step so the audio control stays stable across segments, which stops the usual drift you get when you pipe in off the shelf audio embeddings through cross attention.\n\nDuring inference, they add Audio Native Guidance to tighten lip sync and prosody. No face swap or face restore tricks here (FaceFusion, GFP GAN, CodeFormer).\n\nEnd result: long, stable, high quality, ID consistent renders for lectures, dubbing, and agents. And, open source!\n\nIf you are building realistic avatar or video agents, start here: https://github.com/Francis-Rings/StableAvatar",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1957551831393136778"
    }
  },
  {
    "slug": "2025-08-18-1957438589610119557",
    "path": "threads/2025-08-18-1957438589610119557.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-18-1957438589610119557.md",
    "title": "Small core, big empathy: ship a tiny bootstrap, then load accessibility modules only when someone sw...",
    "date": "2025-08-18T13:45:08.137107Z",
    "excerpt": "Small core, big empathy: ship a tiny bootstrap, then load accessibility modules only when someone switches them on. You keep the first hit light and still give folks real controls when they ask, this is how we built our web accessibility plugin in 2017 at @OswaldLabs ♿👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1957438589610119557"
    }
  },
  {
    "slug": "2025-08-18-1957378188365209800",
    "path": "threads/2025-08-18-1957378188365209800.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-18-1957378188365209800.md",
    "title": "Just read @JosvdWest's write-up on acquiring the Unity MCP repo... you don't get to see repo acquisi...",
    "date": "2025-08-18T09:45:07.177112Z",
    "excerpt": "Just read @JosvdWest's write-up on acquiring the Unity MCP repo... you don't get to see repo acquisitions often - buying distribution in OSS means you're migrating SEO signals and trust. I've gotten offers for some of my more popular projects and it's... interesting?",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1957378188365209800"
    }
  },
  {
    "slug": "2025-08-18-1957317795974369441",
    "path": "threads/2025-08-18-1957317795974369441.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-18-1957317795974369441.md",
    "title": "Back in 2014 I shipped Aptitude, a tiny theme to publish a clean one page articles in minutes. Three...",
    "date": "2025-08-18T05:45:08.729563Z",
    "excerpt": "Back in 2014 I shipped Aptitude, a tiny theme to publish a clean one page articles in minutes. Three CSS files, copy the demo, hit deploy, then let the words breathe. The real goal was less build, more writing. A decade later I revisited it to see how small front end choices age... 📄👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1957317795974369441"
    }
  },
  {
    "slug": "2025-08-17-1957098847198707835",
    "path": "threads/2025-08-17-1957098847198707835.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-17-1957098847198707835.md",
    "title": "I just read @josefprusa's piece on 3D printing hardware and the pipeline that turns cheap filings in...",
    "date": "2025-08-17T15:15:01.304725Z",
    "excerpt": "I just read @josefprusa's piece on 3D printing hardware and the pipeline that turns cheap filings into chokepoints for open hardware: utility models, Paris priority, fast border actions.\n\nA patent can be weak and still wreck your supply chain. CN and DE utility models are fast and cheap with no real exam. You can file a bunch and see what sticks. You then get a 12 month Paris priority window to refile abroad. In the US, a Section 337 ITC case can block imports in roughly 16 to 18 months. That is faster than most challenges land, and open hardware feels that first.\n\nThe asymmetry on cost and time is the kicker. In China, a utility model filing is around ¥500. In Europe, oppositions run for years. In the US, an ex parte reexam starts around 6.3k to 12.6k dollars before counsel. An ITC exclusion order keeps biting until it is lifted. That chills open manufacturing.\n\nPolicy makes it worse. China's R and D super deduction sits around 200 percent in many cases. You do not need patents to claim it, but codifying R and D helps, so filings pile up. AM patents grew fast from 2013 to 2020, yet domestic utility models and local filings often do not show up in international family stats. The spike may be hiding in a different dataset.\n\nWhat we can do next: Use CERN OHL v2 with patent retaliation. Publish defensively at scale so prior art is easy to find. Build a hardware OIN or LOT style group with pooled defense and prior art bounties. And yes, use AI to help with search and drafting, with humans in the loop.\n\nLink: https://www.josefprusa.com/articles/open-hardware-in-3d-printing-is-dead/\n\nWho funds a hardware patent defense league that small shops can join? How do we standardize AI assisted defensive publishing across languages?  When we have AI patent clerks, can we make IP protection free, so open source maintainers can protect their good ideas like the big guys can?",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1957098847198707835"
    }
  },
  {
    "slug": "2025-08-17-1957015799744569379",
    "path": "threads/2025-08-17-1957015799744569379.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-17-1957015799744569379.md",
    "title": "This week YC S25’s Cyberdesk launched on HN and I realized how far we've come from LLMs clicking UIs...",
    "date": "2025-08-17T09:45:06.921942Z",
    "excerpt": "This week YC S25’s Cyberdesk launched on HN and I realized how far we've come from LLMs clicking UIs - trajectory caching and deterministic replay with a tight break glass to computer use. That feels right. The threshold policy is basically the product. 🖱️👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1957015799744569379"
    }
  },
  {
    "slug": "2025-08-16-1956827055469064327",
    "path": "threads/2025-08-16-1956827055469064327.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-16-1956827055469064327.md",
    "title": "Reading @Dries on funding OSS like public infrastructure - this might be one of the defining ideas o...",
    "date": "2025-08-16T21:15:06.979531Z",
    "excerpt": "Reading @Dries on funding OSS like public infrastructure - this might be one of the defining ideas of our time. Instead of \"more money\", making maintainers of critical deps funded operators with SLOs, reinforced by upstream first procurement. Finally, risk and incentives line up!",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1956827055469064327"
    }
  },
  {
    "slug": "2025-08-16-1956713809214951723",
    "path": "threads/2025-08-16-1956713809214951723.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-16-1956713809214951723.md",
    "title": "The big shift for me this year: LLMs left the browser and moved into things I wear. I use Ray‑Ban Me...",
    "date": "2025-08-16T13:45:07.032734Z",
    "excerpt": "The big shift for me this year: LLMs left the browser and moved into things I wear. I use Ray‑Ban Meta glasses and a Limitless pendant every day (yes, really!). It happened fast, and it already changes how I look, listen, and decide in the moment. 🕶️👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1956713809214951723"
    }
  },
  {
    "slug": "2025-08-15-1956464668022906980",
    "path": "threads/2025-08-15-1956464668022906980.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-15-1956464668022906980.md",
    "title": "Back in 2016, \"local-language Android for India\" felt like the product. I thought the OS was the sto...",
    "date": "2025-08-15T21:15:07.085011Z",
    "excerpt": "Back in 2016, \"local-language Android for India\" felt like the product. I thought the OS was the story. Turns out language was the wedge and distribution the business. @IndusOS looked like an India-first Android fork. By 2025 the gravity is app stores, billing, and OEM pipes. Channels beat features. 👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1956464668022906980"
    }
  },
  {
    "slug": "2025-08-15-1956351431012986963",
    "path": "threads/2025-08-15-1956351431012986963.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-15-1956351431012986963.md",
    "title": "This week, @IshSup launched Omnara (YC S25), a mission control for AI agents. It turns Claude Code,...",
    "date": "2025-08-15T13:45:09.146077Z",
    "excerpt": "This week, @IshSup launched Omnara (YC S25), a mission control for AI agents. It turns Claude Code, Cursor, and Copilot from quiet background workers into teammates you can guide from your phone w/ real time updates and actionable nudges for those long running jobs. 💻👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1956351431012986963"
    }
  },
  {
    "slug": "2025-08-15-1956291023795364209",
    "path": "threads/2025-08-15-1956291023795364209.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-15-1956291023795364209.md",
    "title": "Country-of-origin labels are really proxies for trust. They hint at process, standards, and service...",
    "date": "2025-08-15T09:45:06.942731Z",
    "excerpt": "Country-of-origin labels are really proxies for trust. They hint at process, standards, and service more than a dot on a map. In the last decade, India showed how open digital rails plus targeted manufacturing policy can rewrite what \"made in\" signals. 🇮🇳👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1956291023795364209"
    }
  },
  {
    "slug": "2025-08-15-1956230629638668476",
    "path": "threads/2025-08-15-1956230629638668476.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-15-1956230629638668476.md",
    "title": "GitHub added their MCP server in the navbar, so I was curious about how they built it. It plugs real...",
    "date": "2025-08-15T05:45:07.910662Z",
    "excerpt": "GitHub added their MCP server in the navbar, so I was curious about how they built it. It plugs real GitHub context into AI agents. Read code, search repos, manage issues and PRs, and trigger workflows with plain English. \n👨‍💻👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1956230629638668476"
    }
  },
  {
    "slug": "2025-08-14-1956102280496996616",
    "path": "threads/2025-08-14-1956102280496996616.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-14-1956102280496996616.md",
    "title": "The headline is IOI gold - the story is transfer. The same general reasoning stack that hit IMO gold...",
    "date": "2025-08-14T21:15:09.815644Z",
    "excerpt": "The headline is IOI gold - the story is transfer. The same general reasoning stack that hit IMO gold, with zero IOI training, then landed roughly 6th against humans under normal rules. Proofs to programs with the same brain. That is the wow. 🥇👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1956102280496996616"
    }
  },
  {
    "slug": "2025-08-14-1956011683408961698",
    "path": "threads/2025-08-14-1956011683408961698.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-14-1956011683408961698.md",
    "title": "This week at @FirstQuadrant: Contact Summaries and cleaner duplicate merging: One click to know who...",
    "date": "2025-08-14T15:15:12.907981Z",
    "excerpt": "This week at @FirstQuadrant: Contact Summaries and cleaner duplicate merging: One click to know who you're talking to, one click to keep your sales stack tidy 📝👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1956011683408961698"
    }
  },
  {
    "slug": "2025-08-14-1955928642590269762",
    "path": "threads/2025-08-14-1955928642590269762.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-14-1955928642590269762.md",
    "title": "Leaflet is awesome: a tiny JS library for mobile‑friendly interactive maps that still does the big s...",
    "date": "2025-08-14T09:45:08.654483Z",
    "excerpt": "Leaflet is awesome: a tiny JS library for mobile‑friendly interactive maps that still does the big stuff. ~42 KB gzipped JS + 4 KB CSS (yes, really) and an API that gets you from tiles to markers in minutes. My kind of DX.",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1955928642590269762"
    }
  },
  {
    "slug": "2025-08-13-1955770092240953829",
    "path": "threads/2025-08-13-1955770092240953829.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-13-1955770092240953829.md",
    "title": "In 2016, I sketched a tiny idea in my notes: wrap multiple chat web apps in a Swift container, add t...",
    "date": "2025-08-13T23:15:10.296079Z",
    "excerpt": "In 2016, I sketched a tiny idea in my notes: wrap multiple chat web apps in a Swift container, add tabs, sprinkle a little JS, ship. It felt hacky, but the core insight was simple. Aggregation beats fragmentation. Start with webviews, aim for coherence. 👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1955770092240953829"
    }
  },
  {
    "slug": "2025-08-13-1955649300350071032",
    "path": "threads/2025-08-13-1955649300350071032.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-13-1955649300350071032.md",
    "title": "Scott Leibrand's GitHub issue on Claude Code's \"You're absolutely right!\" tic is so funny... the mod...",
    "date": "2025-08-13T15:15:08.378802Z",
    "excerpt": "Scott Leibrand's GitHub issue on Claude Code's \"You're absolutely right!\" tic is so funny... the model agrees when there's nothing to agree with. Is that policy bug showing up as style? https://github.com/anthropics/claude-code/issues/3382",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1955649300350071032"
    }
  },
  {
    "slug": "2025-08-13-1955626655701172705",
    "path": "threads/2025-08-13-1955626655701172705.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-13-1955626655701172705.md",
    "title": "I once asked 2014 me a silly question: how beautiful can an article feel with one stylesheet in ~786...",
    "date": "2025-08-13T13:45:09.637945Z",
    "excerpt": "I once asked 2014 me a silly question: how beautiful can an article feel with one stylesheet in ~786 bytes? I shipped essential.css to find out. Constraints over features. Fast by default. The idea of worked better than I expected. \n\nArchitecture in miniature:\n• Style the HTML you already have: h1 to h6, p, a, img, blockquote\n• One column with a ~65ch measure and comfy line height\n• Images scale to the container\n• Simple header and footer\n• Element selectors only so overrides stay easy\n\nTradeoffs: no theming, no RTL, no print, and a11y leaned on the author. I stood on Normalize.css and friends.",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1955626655701172705"
    }
  },
  {
    "slug": "2025-08-12-1955286911108690195",
    "path": "threads/2025-08-12-1955286911108690195.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-12-1955286911108690195.md",
    "title": "I like that Anthropic's chat \"memory\" is retrieval first, not a creeping user profile. The win is us...",
    "date": "2025-08-12T15:15:16.714676Z",
    "excerpt": "I like that Anthropic's chat \"memory\" is retrieval first, not a creeping user profile. The win is user in the loop recall that cuts surprise context and fits enterprise controls. Less magical vibes, more predictable recall.",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1955286911108690195"
    }
  },
  {
    "slug": "2025-08-12-1955203859720310898",
    "path": "threads/2025-08-12-1955203859720310898.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-12-1955203859720310898.md",
    "title": "Just read @al3rez on dropping task apps for one todo.txt for faster capture and review, and data tha...",
    "date": "2025-08-12T09:45:09.592776Z",
    "excerpt": "Just read @al3rez on dropping task apps for one todo.txt for faster capture and review, and data that lasts. Append only logs fail less than multi screen task managers with flaky sync.",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1955203859720310898"
    }
  },
  {
    "slug": "2025-08-11-1955015116388515862",
    "path": "threads/2025-08-11-1955015116388515862.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-11-1955015116388515862.md",
    "title": "Active learning is back? The real move is optimizing for expert agreement on messy policy tasks... w...",
    "date": "2025-08-11T21:15:10.004200Z",
    "excerpt": "Active learning is back? The real move is optimizing for expert agreement on messy policy tasks... with high‑fidelity labels, up to 10,000x less data at equal or better quality. The catch is getting those labels. 🔖🔖🔖",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1955015116388515862"
    }
  },
  {
    "slug": "2025-08-11-1954901877113700711",
    "path": "threads/2025-08-11-1954901877113700711.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-11-1954901877113700711.md",
    "title": "There are conflicting reports on how smart GPT-5 is in day-to-day usage, but I think that's not the...",
    "date": "2025-08-11T13:45:11.567937Z",
    "excerpt": "There are conflicting reports on how smart GPT-5 is in day-to-day usage, but I think that's not the main innovation. GPT-5 in ChatGPT is really OpenAI collapsing the model menu into a router. UX moves to an autoswitcher that spends test-time compute. When routing hits, it feels like magic. When it whiffs, it feels broken.",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1954901877113700711"
    }
  },
  {
    "slug": "2025-08-11-1954841487084278107",
    "path": "threads/2025-08-11-1954841487084278107.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-11-1954841487084278107.md",
    "title": "I re-read my 2013 post on Orwell and the internet. In 2025 the web still feels borderless, but contr...",
    "date": "2025-08-11T09:45:16.205334Z",
    "excerpt": "I re-read my 2013 post on Orwell and the internet. In 2025 the web still feels borderless, but control is territorial. Most of our bits live in a few US anchored clouds and pick up their laws and secret courts along the way. That jurisdiction gap is the real privacy story now.👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1954841487084278107"
    }
  },
  {
    "slug": "2025-08-11-1954822215511478394",
    "path": "threads/2025-08-11-1954822215511478394.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-11-1954822215511478394.md",
    "title": "I feel like @leerob's new post reflecting on the switch from Vercel to Cursor is more about incentiv...",
    "date": "2025-08-11T08:28:38.607765Z",
    "excerpt": "I feel like @leerob's new post reflecting on the switch from Vercel to Cursor is more about incentives that shape our architecture. A bundler‑coupled RSC plus non‑commercial stewardship left space that frameworks rushed into and that's how we talked about React ca. 2020 to 2025.",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1954822215511478394"
    }
  },
  {
    "slug": "2025-08-11-1954781094626447429",
    "path": "threads/2025-08-11-1954781094626447429.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-11-1954781094626447429.md",
    "title": "Best bit from @simonw's Bay Area AI Security talk: don’t think \"prompt injection\" but think permissi...",
    "date": "2025-08-11T05:45:17.459849Z",
    "excerpt": "Best bit from @simonw's Bay Area AI Security talk: don’t think \"prompt injection\" but think permission composition. Private data + untrusted content + egress equals a data‑theft machine. That combo is the lethal trifecta. 3️⃣👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1954781094626447429"
    }
  },
  {
    "slug": "2025-08-10-1954562134458995088",
    "path": "threads/2025-08-10-1954562134458995088.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-10-1954562134458995088.md",
    "title": "Some more thoughts on the attempt to hide model choice behind a learned router with GPT-5 in ChatGPT...",
    "date": "2025-08-10T15:15:13.481722Z",
    "excerpt": "Some more thoughts on the attempt to hide model choice behind a learned router with GPT-5 in ChatGPT, then the quick rollback when power users wanted control. 🧵",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1954562134458995088"
    }
  },
  {
    "slug": "2025-08-09-1954290340665647218",
    "path": "threads/2025-08-09-1954290340665647218.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-09-1954290340665647218.md",
    "title": "GPT-5 didn't suddenly get dumber - the router did. Autoswitching across models made capability feel...",
    "date": "2025-08-09T21:15:12.620472Z",
    "excerpt": "GPT-5 didn't suddenly get dumber - the router did. Autoswitching across models made capability feel random, so folks blamed the brain instead of the traffic cop. Fixes are rolling and 4o is back while they patch the decision logic.",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1954290340665647218"
    }
  },
  {
    "slug": "2025-08-09-1954177095049048313",
    "path": "threads/2025-08-09-1954177095049048313.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-09-1954177095049048313.md",
    "title": "Last week we shipped Memory (feature preview) - FirstQuadrant can now remember context from your sal...",
    "date": "2025-08-09T13:45:12.981875Z",
    "excerpt": "Last week we shipped Memory (feature preview) - FirstQuadrant can now remember context from your sales conversations and reuse it to make every email, intro, and follow‑up more personal and consistent. I'm really excited about this one. 👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1954177095049048313"
    }
  },
  {
    "slug": "2025-08-08-1953927953626378397",
    "path": "threads/2025-08-08-1953927953626378397.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-08-1953927953626378397.md",
    "title": "It's not about how big it is, it's about how you use it?\n\nIt seems like the headline isn't size anym...",
    "date": "2025-08-08T21:15:15.878400Z",
    "excerpt": "It's not about how big it is, it's about how you use it?\n\nIt seems like the headline isn't size anymore, it's convergence. Closed SOTA nudges up on coding, but the gap to strong open weights is now single digits, and most of the real gains I'm seeing come from routing, post‑training, and agent scaffolds - not raw scale.",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1953927953626378397"
    }
  },
  {
    "slug": "2025-08-08-1953814709268099120",
    "path": "threads/2025-08-08-1953814709268099120.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-08-1953814709268099120.md",
    "title": "I like that GPT‑5 isn't just another \"bigger model.\" It's a system: a router that switches between a...",
    "date": "2025-08-08T13:45:13.610594Z",
    "excerpt": "I like that GPT‑5 isn't just another \"bigger model.\" It's a system: a router that switches between a fast main model and a deeper reasoning model, with test‑time compute as a knob - and pricing that nudges you to actually turn it.",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1953814709268099120"
    }
  },
  {
    "slug": "2025-08-07-1953391924838355107",
    "path": "threads/2025-08-07-1953391924838355107.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-07-1953391924838355107.md",
    "title": "The persistence of \"www\" in URLs is more inertia than necessity. As browsers evolve, the need for \"w...",
    "date": "2025-08-07T09:45:13.438776Z",
    "excerpt": "The persistence of \"www\" in URLs is more inertia than necessity. As browsers evolve, the need for \"www\" fades - yet many sites still redirect from apex domains to \"www\" out of habit, not logic. 👇",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1953391924838355107"
    }
  },
  {
    "slug": "2025-08-06-1953108824426254574",
    "path": "threads/2025-08-06-1953108824426254574.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-06-1953108824426254574.md",
    "title": "DeepMind's Genie 3 takes a step forward in AI-driven interactive environments, potentially becoming...",
    "date": "2025-08-06T15:00:17.183111Z",
    "excerpt": "DeepMind's Genie 3 takes a step forward in AI-driven interactive environments, potentially becoming \"game engine 2.0.\" Imagine generating real-time, 3D worlds from just text prompts - consistently running at 720p and 24fps!",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1953108824426254574"
    }
  },
  {
    "slug": "2025-08-06-1953063523770351996",
    "path": "threads/2025-08-06-1953063523770351996.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-06-1953063523770351996.md",
    "title": "Cloudflare's action against Perplexity AI highlights a key tension in the AI world: balancing data a...",
    "date": "2025-08-06T12:00:11.380483Z",
    "excerpt": "Cloudflare's action against Perplexity AI highlights a key tension in the AI world: balancing data access with web standards adherence. I'm on team Perplexity because I wouldn't differentiate between Perplexity app the Comet browser - it's browsing on my behalf.",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1953063523770351996"
    }
  },
  {
    "slug": "2025-08-06-1953048415547605201",
    "path": "threads/2025-08-06-1953048415547605201.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-08-06-1953048415547605201.md",
    "title": "OpenAI's latest release of GPT-OSS models, gpt-oss-120b and gpt-oss-20b, marks a big shift towards o...",
    "date": "2025-08-06T11:00:20.197926Z",
    "excerpt": "OpenAI's latest release of GPT-OSS models, gpt-oss-120b and gpt-oss-20b, marks a big shift towards open-weight AI. This means developers can now tap into some seriously advanced reasoning capabilities.",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1953048415547605201"
    }
  },
  {
    "slug": "2025-06-03-1929865458091704411",
    "path": "threads/2025-06-03-1929865458091704411.md",
    "source": "https://github.com/AnandChowdhary/notes/blob/main/threads/2025-06-03-1929865458091704411.md",
    "title": "Here’s the AI prompt we use to generate our \"famous\" weekly changelogs from git commit history\n\nFirs...",
    "date": "2025-06-03T11:39:25.079237Z",
    "excerpt": "Here’s the AI prompt we use to generate our \"famous\" weekly changelogs from git commit history\n\nFirst, we fetch all the commits: git log --pretty=format:\"%h : %s\" --since=\"${startDate}\" --until=\"${endDate}\"\n\nand then we format them and feed those into the prompt - and the prompt generates a very well-written, categorized prompt that we publish on our @mintlify docs site using a GitHub Actions workflow every Monday.\n\nHere are some of the features of the prompt:\n- Strict categorization so it knows what to include and what to skip - “New features” “Improvements” “Fixes” “Behind the scenes”\n- User-facing changes vs backend: Uses a simple decision rule: “Can the user see or interact with this in the app? If no, it goes in Behind the scenes”\n- Includes 4 actual @firstquadrant changelogs that I had previously hand-written as examples\n- Adds product context and a glossary for improved domain-specific terminology\n- Clear formatting rules for consistency between generated changelogs\n",
    "attributes": {
      "twitter": "https://x.com/AnandChowdhary/status/1929865458091704411"
    }
  }
]